{
    "title": "Stefan Bozkurt - Senior Frontend Developer...",
    "main-headline": "Frontend Developer.",
    "greeting": "Hello!",
    "intro": "I am Stefan, a Senior Frontend Developer with over 20 years of experience in frontend development. My focus is on WordPress, HubSpot CMS, and the development of A/B tests to drive data-driven optimizations. <br><br> I am based in Berlin and currently work at mediaworx berlin GmbH as part of the MAI Group, where I bring my passion for creative coding and modern web design.",
    "lang": "Language:",
    "lang-option-de": "German",
    "lang-option-en": "English",
    "menu-item-1": "Competence",
    "menu-item-2": "Know-how",
    "menu-item-3": "Experience",
    "menu-item-4": "Q&A",
    "competence-headline": "Competence",
    "competence-intro": "Whether it's the development of flexible online presences, the implementation of custom modules or optimisation through A/B testing - my work focuses on clean code and technical implementation that delivers measurable results.<br><br>The following areas show the key areas of my work:",
    "competence-wordpress-headline": "WordPress Development",
    "competence-wordpress-item-1": "<b>Individual themes & templates</b> - development & customisation of bespoke designs",
    "competence-wordpress-item-2": "<b>Advanced Custom Fields<b> - development of customised blocks and flexible content management with user-defined fields",
    "competence-wordpress-item-3": "<b>Gutenberg Editor</b> - creation of flexible, reusable blocks for customised layouts",
    "competence-wordpress-item-4": "<b>Performance optimisation</b> - fast loading times through caching & modern image formats",
    "competence-wordpress-item-5": "<b>Reusable elements</b> - widgets, shortcodes & dynamic components",
    "competence-wordpress-item-6": "<b>Plugins & extensions</b> - customised functions through targeted plugin integration",
    "competence-wordpress-item-7": "<b>Version Control & Deployment</b> - GitHub for version control and GitHub Actions for automated deployments",
    "competence-hubspot-headline": "HubSpot CMS Development",
    "competence-hubspot-item-1": "<b>Module & template development</b> - customised themes & components for websites, landing pages & blogs",
    "competence-hubspot-item-2": "<b>HubL & Custom Modules</b> - extending the functionality with your own HubSpot modules",
    "competence-hubspot-item-3": "<b>Dynamic content & automation</b> - smart solutions with HubDB & personalised content",
    "competence-hubspot-item-4": "<b>Form & API integration</b> - customisation & integration of HubSpot forms & external data sources",
    "competence-hubspot-item-5": "<b>Performance & SEO optimisation</b> - clean code, fast loading times & structured data",
    "competence-hubspot-item-6": "<b>Version Control & Deployment</b> - GitHub for version control and GitHub Actions for automated deployments",
    "competence-abtesting-headline": "A/B Testing & Conversion Rate Optimization (CRO)",
    "competence-abtesting-item-1": "<b>Test variant development</b> - creating variants with HTML, CSS and JavaScript",
    "competence-abtesting-item-2": "<b>Tracking & analysis</b> - event listeners, cookies and local storage for precise measurements",
    "competence-abtesting-item-3": "<b>Testing tools integration</b> - connection of A/B testing tools and APIs for variant delivery",
    "competence-abtesting-item-4": "<b>Optimising the user experience</b> - data-driven adjustments to increase the conversion rate",
    "competence-abtesting-item-5": "<b>Performance</b> - optimisation of loading times and stable delivery of variants",
    "know-how-headline": "Know-how",
    "know-how-intro": "For me, web development means combining structured code with intuitive user guidance. I have mastered a broad spectrum - from HTML and CSS to interactive web applications - and focus on modern front-end technologies and an optimised user experience.",
    "know-how-frontend-headline": "Frontend development",
    "know-how-frontend-item-1": "Creation of responsive layouts with HTML5 and CSS3",
    "know-how-frontend-item-2": "Implementation of interactive features with JavaScript",
    "know-how-frontend-item-3": "Development of PHP-based logic for the creation and customisation of templates",
    "know-how-frontend-item-4": "Use of AI-supported tools: Support for code optimisation, error analysis and automation of development processes",
    "know-how-backend-headline": "Back-End & Databases",
    "know-how-backend-item-1": "Extension of WordPress with JavaScript-based interactivity and PHP logic for customised solutions",
    "know-how-backend-item-2": "ACF & Gutenberg: Flexible content management through user-defined fields and blocks",
    "know-how-backend-item-3": "Use of AJAX for asynchronous data queries and dynamic content loading",
    "know-how-backend-item-4": "Implementation and customisation of frontend site editing (FSE) to enable user-friendly and visual page editing in the backend",
    "know-how-devprocess-headline": "Development processes & tools",
    "know-how-devprocess-item-1": "Use of task runners such as Gulp or Webpack",
    "know-how-devprocess-item-2": "Automation of CSS and JavaScript minification.",
    "know-how-devprocess-item-3": "Code reviews and best practices for quality assurance",
    "know-how-devprocess-item-4": "Use of Git for versioning code and team collaboration",
    "know-how-devprocess-item-5": "Use of local development environments for efficient development and testing",
    "know-how-ui-ux-headline": "Optimisation of user experience",
    "know-how-ui-ux-item-1": "Ensuring mobile-first development",
    "know-how-ui-ux-item-2": "Lazy loading of content for loading time optimisation",
    "know-how-ui-ux-item-3": "Creation of user-friendly form elements and validation",
    "know-how-ui-ux-item-4": "A/B testing to improve the user interface",
    "know-how-ui-ux-item-5": "Integration von Accessibility (WCAG)-Best Practices",
    "experience-headline": "Experience and career",
    "experience-intro": "Over the course of my professional journey, I have gained valuable experience, mastered new challenges and continued to develop. Each station has not only expanded my skills, but also shaped my perspectives and moulded my career.",
    "experience-mediaworx": "Senior Frontend Developer | MAI mediaworx Berlin",
    "experience-mediaworx-intro": "As a senior WordPress and HubSpot developer at MAI Mediaworx Berlin, I implement websites, blogs and landing pages, optimise their performance and work on conversion rate optimisation (CRO). I ensure the continuous development and security of the platforms in close collaboration with clients, internal teams and external partners.",
    "experience-mediaworx-button-1": "Financial Services",
    "experience-mediaworx-button-2": "Agency blog",
    "experience-mediaworx-button-3": "Healthcare services",
    "experience-mediaworx-button-4": "Charging infrastructure",
    "experience-mediaworx-button-5": "e-mobility",
    "experience-mediaworx-button-6": "Corporate Website",
    "experience-mediaworx-button-7": "Private bank",
    "experience-mediaworx-project-challenge-headline": "Challenge:",
    "experience-mediaworx-project-solution-headline": "Solution & results:",
    "experience-mediaworx-project-technologies-headline": "Technologies:",
    "experience-mediaworx-project-1-challenge": "A financial services provider needed a responsive and user-friendly website that would enable easy content management and reflect the professionalism of the company. Collaboration with an external agency and a visual design freelancer was required to optimise design and technology.",
    "experience-mediaworx-project-1-solution-item-1": "User-friendly and professional website",
    "experience-mediaworx-project-1-solution-item-2": "Flexible content management with ACF",
    "experience-mediaworx-project-1-solution-item-3": "Responsive design for all devices",
    "experience-mediaworx-project-1-solution-item-4": "Improved usability and user retention",
    "experience-mediaworx-project-1-technologies": "WordPress, PHP, ACF",
    "experience-mediaworx-project-2-challenge": "The agency blog required regular maintenance to ensure that all content was up-to-date and the technical infrastructure met the latest standards. It was also important to add new features to continuously improve the blog and meet the needs of the target group.",
    "experience-mediaworx-project-2-solution-item-1": "Responsibility for template creation, plugin maintenance and securing the blog",
    "experience-mediaworx-project-2-solution-item-2": "Regular security updates and feature enhancements for continuous improvement",
    "experience-mediaworx-project-2-solution-item-3": "Stable performance and high security standards",
    "experience-mediaworx-project-2-technologies": "WordPress, , Custom Post Types, template creation, plugin management",
    "experience-mediaworx-project-3-challenge": "The WordPress-based website of a charitable foundation suffered from long loading times and poor performance caused by a resource-intensive page builder. This led to a poor user experience, a low SEO ranking and increased bounce rates. In addition, content creation was cumbersome and time-consuming for editors.",
    "experience-mediaworx-project-3-solution-item-1": "Replacement of the page builder with an optimised solution based on ACF",
    "experience-mediaworx-project-3-solution-item-2": "Optimisation of performance through minification and asynchronisation of HTML, CSS and JavaScript",
    "experience-mediaworx-project-3-solution-item-3": "Lighthouse performance points increased from 53 to 91 and loading times reduced by over 50 percent",
    "experience-mediaworx-project-3-solution-item-4": "Improved SEO rankings and better findability",
    "experience-mediaworx-project-3-solution-item-5": "Easier and faster content creation for editors",
    "experience-mediaworx-project-3-technologies": "WordPress, PHP, ACF, Node.js, NPM, caching optimisation (nginx), HTML, CSS, JavaScript",
    "experience-mediaworx-project-4-challenge": "The website for the charging infrastructure not only had to be functional and responsive, but also offer a visually impressive presentation of the product. In addition, external HubSpot forms had to be integrated and content management optimised.",
    "experience-mediaworx-project-4-solution-item-1": "360-degree view of the product with smooth animations thanks to GSAP",
    "experience-mediaworx-project-4-solution-item-2": "Integration of HubSpot forms to support marketing and lead generation",
    "experience-mediaworx-project-4-solution-item-3": "Optimised content management by switching to ACF instead of Elementor",
    "experience-mediaworx-project-4-solution-item-4": "Responsive design for optimal display on all devices",
    "experience-mediaworx-project-4-technologies": "WordPress, ACF, GSAP: 360-degree view (image integration), HubSpot forms",
    "experience-mediaworx-project-5-challenge": "A blog on electromobility topics should not only offer up-to-date and informative content, but also user-friendly navigation and an appealing design. It was also important to design the blog technically in such a way that it would reach a broad target group and rank well in search results.",
    "experience-mediaworx-project-5-solution-item-1": "User-friendly design through customisation with a child theme",
    "experience-mediaworx-project-5-solution-item-2": "Glossary with search function for better explanation of electromobility terms",
    "experience-mediaworx-project-5-solution-item-3": "Multimedia content thanks to custom modules for video and audio",
    "experience-mediaworx-project-5-solution-item-4": "Increased reach thanks to targeted SEO optimisation",
    "experience-mediaworx-project-5-technologies": "HubSpot, child theme, Hubl, custom modules (video & audio), custom glossary with search function",
    "experience-mediaworx-project-6-challenge": "The corporate website should represent the company professionally and offer a user-friendly interface for editors, with HubSpot for lead management. Interactive forms and a responsive design ensure optimal use on all devices and high accessibility.",
    "experience-mediaworx-project-6-solution-item-1": "User-friendly backend for easy content management by editors",
    "experience-mediaworx-project-6-solution-item-2": "Interactive forms to improve user interaction",
    "experience-mediaworx-project-6-solution-item-3": "Custom module development for customised functions",
    "experience-mediaworx-project-6-solution-item-4": "Asynchronous JavaScript for faster loading time and better performance",
    "experience-mediaworx-project-6-solution-item-5": "Responsive design for perfect display on all devices",
    "experience-mediaworx-project-6-solution-item-6": "Accessibility according to the WCAG-AA guidelines",
    "experience-mediaworx-project-6-technologies": "HubSpot, Custom Modules, Hubl, Asynchronous JavaScript, Astro, WCAG-AA",
    "experience-mediaworx-project-7-challenge": "A new magazine section was to be integrated into the existing website for a Swiss private bank. The prototype had to be designed in such a way that it could be easily integrated into the existing CMS and simply filled with content.",
    "experience-mediaworx-project-7-solution-item-1": "Realisation of a static HTML prototype with doctype for easy integration into the existing CMS",
    "experience-mediaworx-project-7-solution-item-2": "JavaScript (jQuery) and HTML5 for a modern and high-performance implementation",
    "experience-mediaworx-project-7-solution-item-3": "Responsive design for optimal display on all devices",
    "experience-mediaworx-project-7-solution-item-4": "Successful integration of the magazine area",
    "experience-mediaworx-project-7-technologies": "Doctype, jQuery, HTML5, Git, Node.js, NPM",
    "experience-berliner-verlag": "Wordpress Theme Developer | Berliner Verlag / Dumont",
    "experience-berliner-verlag-intro": "As a WordPress theme developer at Berliner Verlag, I was responsible for the implementation and maintenance of websites, landing pages and blogs. As part of the new formation of the marketing team, I worked on digital solutions that supported the marketing strategy, using both pre-built and customised themes and templates. My tasks included integrating interactive elements with HTML, CSS and JavaScript (especially jQuery) to ensure a user-friendly web experience.<br><br>I also managed the hosting of the WordPress projects and implemented a custom Adobe tracking tool for analysis.<br><br>I am particularly pleased that a Wordpress project I was involved in has been nominated for the <a href=\"https://www.grimme-online-award.de/archiv/2018/nominierte/n/d/die-akte-amri-und-der-staat-sah-zu\" target=\"_blank\" rel=\"noopener noreferrer\">Grimme Online Award</a>.",
    "experience-iconmobile2": "QA-Manager | iconmobile",
    "experience-iconmobile1": "Frontend Developer | iconmobile",
    "experience-one-screen": "Freelancer Webdevelopment",
    "experience-sinnerschrader": "Frontend Developer | SinnerSchrader",
    "faq-headline": "Still have questions?",
    "faq-question1": "Three things that no good front end should be without?",
    "faq-answer1": "Clean design, fast loading times and a good UX. Nobody likes ugly and slow sites!",
    "faq-question2": "Design that is difficult to implement - how do you deal with it?",
    "faq-answer2": "First of all, stay calm! I talk to the designer, suggest alternatives and find a middle way. Teamwork is everything.",
    "faq-question3": "A bug makes absolutely no sense - what now?",
    "faq-answer3": "Console.log is my best friend! And if that doesn't help: fresh air, coffee or let a colleague look over it.",
    "faq-question4": "What needs to happen for a website to look good on all devices?",
    "faq-answer4": "Think mobile first, flexible CSS (grid & flexbox) and lots of testing - emulators help, but real devices are better!",
    "faq-question5": "The best thing about frontend development for you is...?",
    "faq-answer5": "The wow moment when an idea comes to life and the user understands it intuitively. And, of course, when everything runs without bugs.",
    "faq-question6": "Tell us: What does your perfect day look like?",
    "faq-answer6": "I'd get on my bike and explore an area I've never ridden before. Preferably with little traffic, lots of nature and a few new favourite roads.",
    "footer1": "Contact",
    "footer2": "Phone",
    "footer3": "Imprint",
    "footer4": "Information according to ยง5 TMG:",
    "footer5": "Contents",
    "footer6": "Network"
}